peiChangDec3th = {
	srv001 = {--12月3日降龙人物赔偿
		[190786] = 
			{
				[301004] = 16,--   洗点
				[10046] = 1,--   16神兵
			},
		[180826] = 
			{
				[5038] = 1,--   高级升级礼包
			},
		[161367] = 
			{
				[15136] = 3,--   双倍经验丹（大）
				[15134] = 17,--   双倍经验丹（小）
				[15004] = 17,--   九元丹
				[50026] = 20,--   替身人偶
			},
		[92148] = 
			{
				[5025] = 1,--   快速升级包
			},
	},

	srv002 = {--12月3日降龙人物赔偿
		[153495] = 
			{
				[25008] = 1,--   龙众1 
				[25018] = 1,--   金黄宝石1
			},
		[241763] = 
			{
				[50001] = 7,--   狮子吼7 
				gold = 30000
			},
		[225551] = 
			{
				[25001] = 20,--   紧那罗残玉 20
				[25005] = 20,--   阿修罗残玉 20
				[25006] = 20,--   迦楼罗残玉 20
			},
		[225162] = 
			{
				gold = 50000
			},
		[223928] = 
			{
				[10075] = 1,--   25 神兵   
				[2527] = 1,--   乌灵腰带   
				[5038] = 1,--   高级升级礼包  
			},
		[220396] = 
			{
				[10061] = 1,--   21神兵 
				[25001] = 17,--   紧那罗残玉   
				[25003] = 15,--   夜叉残玉 
				[25006] = 13,--   迦楼罗残玉
				[25007] = 1,--   天众   
				[25008] = 15,--   龙众
				[1334] = 1, --50限时蓝装
				[2133] = 1, --50限时蓝装
				[2579] = 1, --50限时蓝装
				[3634] = 1, --50限时蓝装
				[4133] = 1, --50限时蓝装
				[4636] = 1, --50限时蓝装
			},
		[168931] = 
			{
				[15145] = 1,--   白金卡   
			}
	}
}

log.info(TianLongServer.srvId)

function peichang()
	for k, v in pairs(peiChangDec3th[TianLongServer.srvId]) do
		for kk, vv in pairs(v) do
			if kk == "gold" then
				MailManager:sendSysMail(k, "客服信件", "×××××××××××××", vv, nil)
			elseif type(kk) == "number" then
				MailManager:sendSysMail(k, "客服信件", "×××××××××××××", 0, ItemSet[kk]:creatJavaItem(vv))
			end
		end
	end
end